---
kind: other
id: AllMembers.T:Autodesk.Revit.Exceptions.ArgumentNullException
source: html/d12dbacb-0a56-e0c3-cddf-b3236ff89a51.htm
---
# ArgumentNullException Members

Retrieves data needed to serialize the target object.